[
  {
    "year": "1571",
    "title": "Origins in Bay",
    "description": "Fr. Martin de Rada builds the first bamboo and nipa church along the lakeshore of Bay, marking the ecclesiastical beginnings of the area."
  },
  {
    "year": "1589",
    "title": "The Naming",
    "description": "Franciscan friar Fr. Pedro Bautista visits the hot springs of 'Mainit' at the foot of Mt. Makiling. Recognizing their curative powers, he renames the settlement 'Los Baños' (The Bathing Places)."
  },
  {
    "year": "1602",
    "title": "Hospital de Aguas Santas",
    "description": "Establishment of the 'Hospital de Aguas Santas de Mainit' by Fr. Diego Santa Maria to harness the thermal waters for healing."
  },
  {
    "year": "1615",
    "title": "Independent Town",
    "description": "On September 17, Los Baños is officially separated from Bay and declared an independent pueblo administered by the Franciscans."
  },
  {
    "year": "1640",
    "title": "First Governance",
    "description": "Juan Castañeda is appointed as the first Gobernadorcillo (Little Governor) of the municipality."
  },
  {
    "year": "1790",
    "title": "The Stone Church",
    "description": "Construction of the first stone church begins under Fr. Domingo Mateo, replacing earlier structures destroyed by fire."
  },
  {
    "year": "1897",
    "title": "Mabini's Revolution",
    "description": "The sublime paralytic Apolinario Mabini seeks therapy in the hot springs. During his stay, he drafts plans for the revolution against Spain."
  },
  {
    "year": "1909",
    "title": "UP College of Agriculture",
    "description": "Establishment of the UP College of Agriculture (now UPLB), transforming the town into a premier hub for agricultural research in Asia."
  },
  {
    "year": "1945",
    "title": "The Great Raid",
    "description": "On February 23, Allied forces and Filipino guerillas execute the daring Raid at Los Baños, rescuing over 2,000 civilian internees from the Baker Hall internment camp."
  },
  {
    "year": "1946",
    "title": "War Crimes Trials",
    "description": "Japanese Generals Tomoyuki Yamashita and Masaharu Homma are tried and executed in Los Baños for war crimes committed during the occupation."
  },
  {
    "year": "1959",
    "title": "World Scout Jamboree",
    "description": "Los Baños hosts the 10th World Scout Jamboree, welcoming over 12,000 scouts from around the globe to the Makiling foothills."
  },
  {
    "year": "1962",
    "title": "IRRI Established",
    "description": "The International Rice Research Institute (IRRI) is founded, cementing the town's status as the global capital for rice science."
  },
  {
    "year": "1982",
    "title": "Special Science and Nature City",
    "description": "By virtue of Presidential Proclamation 349, Los Baños is declared the 'Special Science and Nature City of the Philippines' in recognition of its contributions to forestry, agriculture, and life sciences."
  },
  {
    "year": "2016",
    "title": "Camp Gen. Macario Sakay",
    "description": "Camp Eldridge, site of the historic hospital and military base, is renamed Camp General Macario Sakay to honor the Filipino revolutionary leader."
  }
]
